app/views/restaurants/_form.html.erb

SELECT "neighborhoods".* FROM "neighborhoods"
---
    <%= f.label :neighborhood %><br>
    <%= collection_select(:restaurant, :neighborhood_id, Neighborhood.all, :id, :name, include_blank: true) %>

SELECT "categories".* FROM "categories"
---
    <%= f.label :category %><br>
    <%= collection_check_boxes(:restaurant, :category_ids, Category.all, :id, :name) %>