app/views/restaurants/edit.html.erb

    <%= f.label :neighborhood %><br>
    <%= collection_select(:restaurant, :neighborhood_id, Neighborhood.all, :id, :name, include_blank: true) %>
---
SELECT "neighborhoods".* FROM "neighborhoods"

  <p>
    <%= collection_check_boxes(:restaurant, :category_ids, Category.all, :id, :name) %>
---
SELECT "categories".* FROM "categories"